json-servlet-load-testing.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="3.1" jmeter="3.1 r1770033">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="host" elementType="Argument">
            <stringProp name="Argument.name">host</stringProp>
            <stringProp name="Argument.value">positive-design-162500.appspot.com</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
            <stringProp name="Argument.desc">Host of Webservice</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <BeanShellPreProcessor guiclass="TestBeanGUI" testclass="BeanShellPreProcessor" testname="BeanShell PreProcessor" enabled="true">
        <boolProp name="resetInterpreter">false</boolProp>
        <stringProp name="script">String[] words = new String[]{&quot;30&quot;,&quot;wa&quot;,&quot;wat&quot;,&quot;watt&quot;,&quot;pr&quot;,&quot;pra&quot;,&quot;pran&quot;,&quot;prank&quot;,&quot;pa&quot;,&quot;pac&quot;,&quot;pack&quot;,&quot;ga&quot;,&quot;gam&quot;,&quot;game&quot;,&quot;sl&quot;,&quot;sle&quot;,&quot;slee&quot;,&quot;th&quot;,&quot;thu&quot;,&quot;thum&quot;,&quot;xt&quot;,&quot;xtr&quot;,&quot;xtre&quot;,&quot;xtrem&quot;,&quot;xtreme&quot;,&quot;xx&quot;,&quot;xxl&quot;,&quot;fo&quot;,&quot;for&quot;,&quot;bs&quot;,&quot;bs4&quot;,&quot;mu&quot;,&quot;mul&quot;,&quot;mult&quot;,&quot;multi&quot;,&quot;aa&quot;,&quot;aax&quot;,&quot;aaxa&quot;,&quot;re&quot;,&quot;ref&quot;,&quot;refu&quot;,&quot;refur&quot;,&quot;refurb&quot;,&quot;refurbi&quot;,&quot;refurbis&quot;,&quot;refurbish&quot;,&quot;refurbishe&quot;,&quot;wx&quot;,&quot;wxg&quot;,&quot;wxga&quot;,&quot;p&quot;,&quot;pi&quot;,&quot;pic&quot;,&quot;pico&quot;,&quot;dl&quot;,&quot;dlp&quot;,&quot;pr&quot;,&quot;pro&quot;,&quot;proj&quot;,&quot;proje&quot;,&quot;projec&quot;,&quot;project&quot;,&quot;projecto&quot;,&quot;projector&quot;,&quot;so&quot;,&quot;sof&quot;,&quot;soft&quot;,&quot;bl&quot;,&quot;bla&quot;,&quot;blac&quot;,&quot;black&quot;};
String separator = &quot;%20&quot;;
	
int minWords = 1;
int maxWords = 5;
double chanceSpawnWord = 0.6;
double chanceSpawnNextWordModifier = 0.4;
Random random = new Random();

int nWords = 0;
StringBuilder result = new StringBuilder();
while(nWords &lt; maxWords &amp;&amp; (nWords &lt; minWords || random.nextDouble() &lt; chanceSpawnWord)) {
	result.append(words[random.nextInt(words.length-1)] + separator);
	if(nWords &gt;= minWords) {
		chanceSpawnWord *= chanceSpawnNextWordModifier;
	}
	nWords++;
}
vars.put(&quot;randomOption&quot;, result.toString().substring(0,result.length()-separator.length()));</stringProp>
      </BeanShellPreProcessor>
      <hashTree/>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">${host}</stringProp>
        <stringProp name="HTTPSampler.concurrentPool">4</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Number of Users" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">100</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">120</stringProp>
        <stringProp name="ThreadGroup.ramp_time">2</stringProp>
        <longProp name="ThreadGroup.start_time">1375525852000</longProp>
        <longProp name="ThreadGroup.end_time">1375525852000</longProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="RESTful Products Request" enabled="true">
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp name="Arguments.arguments">
              <elementProp name="q" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">${randomOption}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
                <boolProp name="HTTPArgument.use_equals">true</boolProp>
                <stringProp name="Argument.name">q</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">/product</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <boolProp name="HTTPSampler.monitor">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">text/xml; charset=utf-8</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-1390343859">jsonCallback</stringProp>
            </collectionProp>
            <stringProp name="TestPlan.comments">Verify content in response</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="StatGraphVisualizer" testclass="ResultCollector" testname="Aggregate Graph" enabled="true">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>